In [1]:
import pandas as pd

* Series ---- 1d array
* Data frame ---- 2d array (table format, row & col)

In [2]:
a = pd.Series([])
b = pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10, 'b':15,'c':56, 'd':99})

C:\Users\PARTH\AppData\Local\Temp\ipykernel_10936\177270645.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [7]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [8]:
import numpy as np

In [9]:
n = np.array([1,2,3,4,40])

In [10]:
x = pd.Series(n)

In [11]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [12]:
e = pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [13]:
e

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [14]:
b[2]

33

In [15]:
e[2]

[11, 10]

In [16]:
d['d']

99

In [17]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [18]:
f = pd.Series([12,52,42,10,23], index=['q', 'w', 'e', 'r', 't'])

In [19]:
f

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [20]:
g = pd.Series([12,52,42,10,23], index=list('qwert'))

In [21]:
g

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [22]:
g2 = pd.Series([12,52,12,52,10,23,42,10,23])

In [23]:
g2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

# value_counts() Function

In [24]:
g2.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [25]:
g2.argmax()

1

In [26]:
g2.argmin()

4

In [27]:
f.idxmax()

'w'

In [28]:
f.idxmin()

'r'

# DataFrame

In [29]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86])

In [30]:
a

Empty DataFrame
Columns: []
Index: []

In [31]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [32]:
type(b)

pandas.core.frame.DataFrame

In [33]:
c = pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [34]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [35]:
d = pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[7,8,9,10,11],[34,45,56,67,78],[22,33,44,55,66]])

In [36]:
d

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  34  45  56  67  78
4  22  33  44  55  66

In [37]:
d.head()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  34  45  56  67  78
4  22  33  44  55  66

In [38]:
d.tail()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  34  45  56  67  78
4  22  33  44  55  66

In [39]:
d.head(2)

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50

In [40]:
d.sample(3)

    0   1   2   3   4
2   7   8   9  10  11
0   1   2   3   4   5
1  10  20  30  40  50

In [41]:
d1 = pd.DataFrame([[1,2,3,4],[10,20,30,40,50],[7,8,9,10],[34,45,56,67,78],[22,33,44,55]])

In [42]:
d1

    0   1   2   3     4
0   1   2   3   4   NaN
1  10  20  30  40  50.0
2   7   8   9  10   NaN
3  34  45  56  67  78.0
4  22  33  44  55   NaN

In [43]:
d2 = pd.DataFrame([[1,2,np.nan,4],[10,20,np.nan,40,50],['missing',8,9,10],[np.nan,45,56,67,78],[22,33,44,55]])

In [44]:
d2

         0   1     2   3     4
0        1   2   NaN   4   NaN
1       10  20   NaN  40  50.0
2  missing   8   9.0  10   NaN
3      NaN  45  56.0  67  78.0
4       22  33  44.0  55   NaN

In [45]:
d3 = pd.DataFrame([[1,2,np.nan,4],[10,20,np.nan,40,50],['missing',8,9,10],[np.nan,45,56,67,78],[22,33,44,55]], columns= ['colA', 'colB', 'colC', 'colD', 'colE'])

In [46]:
d3

      colA  colB  colC  colD  colE
0        1     2   NaN     4   NaN
1       10    20   NaN    40  50.0
2  missing     8   9.0    10   NaN
3      NaN    45  56.0    67  78.0
4       22    33  44.0    55   NaN

In [47]:
d3['colB']

0     2
1    20
2     8
3    45
4    33
Name: colB, dtype: int64

In [48]:
d3[['colC' , 'colB' ]]

   colC  colB
0   NaN     2
1   NaN    20
2   9.0     8
3  56.0    45
4  44.0    33

In [49]:
d3[0:3]['colC']

0    NaN
1    NaN
2    9.0
Name: colC, dtype: float64

In [50]:
d3[0:3][['colC', 'colB']]

   colC  colB
0   NaN     2
1   NaN    20
2   9.0     8

In [51]:
d3[['colC' , 'colB' ]].head(3)

   colC  colB
0   NaN     2
1   NaN    20
2   9.0     8

In [52]:
d3.shape

(5, 5)

In [53]:
d3['colA']

0          1
1         10
2    missing
3        NaN
4         22
Name: colA, dtype: object

In [54]:
d3['colD'].max()

67

In [55]:
d3['new_col'] = [12,45,77,44,88]

In [56]:
d3

      colA  colB  colC  colD  colE  new_col
0        1     2   NaN     4   NaN       12
1       10    20   NaN    40  50.0       45
2  missing     8   9.0    10   NaN       77
3      NaN    45  56.0    67  78.0       44
4       22    33  44.0    55   NaN       88

In [57]:
d3['new_col2'] = d3['colD'] + d3['new_col']

In [58]:
d3

      colA  colB  colC  colD  colE  new_col  new_col2
0        1     2   NaN     4   NaN       12        16
1       10    20   NaN    40  50.0       45        85
2  missing     8   9.0    10   NaN       77        87
3      NaN    45  56.0    67  78.0       44       111
4       22    33  44.0    55   NaN       88       143

In [59]:
d3['colD'] > 50

0    False
1    False
2    False
3     True
4     True
Name: colD, dtype: bool

In [60]:
h = d3['colD'] > 50

In [61]:
d3[h]

  colA  colB  colC  colD  colE  new_col  new_col2
3  NaN    45  56.0    67  78.0       44       111
4   22    33  44.0    55   NaN       88       143